No Keynote Parameter.\nTo resolve, select key value parameter in keynoting system.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId MissKeynoteParameter { get; }
  Visual Basic
Public Shared ReadOnly Property MissKeynoteParameter As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ MissKeynoteParameter {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures KeynoteFailures Class
  Autodesk.Revit.DB Namespace